def calc_rectangle_suare() -> float:
    """This function calculates the area of rectangle"""
    a = float(input("Введіть довжину прямокутника: "))  # Отримуємо від користувача значення довжини прямокутника
    b = float(input("Введіть ширину прямокутника: "))   # Отримуємо від користувача значення ширини прямокутника
    result = a*b                                        # Обчислюємо площу прямокутника
    print(f"Площа прямокутника = {result}")             # Виводимо у консоль значення площі прямокутника


def calc_triangle_square() -> float:
    """This function calculates the area of triangle"""
    a = float(input("Введіть довжину сторони трикутника: "))                    # Отримуємо від користувача значення довжини сторони трикутника
    h = float(input("Введіть довжину висоти, проведеної до цієї висоти: "))     # Отримуємо від користувача значення довжини висоти трикутника
    result = 0.5*a*h                                                            # Обчислюємо площу трикутника
    print(f"Площа трикутника = {result}")                                       # Виводимо у консоль значення площі трикутника


def calc_circle_square() -> float:
    """This function calculates the area of circle"""
    r = float(input("Введіть радіус кола: "))   # Отримуємо від користувача значення радіусу кола
    result = round(3.14*r**2, 2)                # Обчислюємо площу кола з точністю до сотих
    print(f"Площа кола = {result}")             # Виводимо у консоль значення площі кола


if __name__ == "__main__":
    choice = input("Площу якої фігури Ви бажаєте розрахувати?\nВведіть відповідну цифру:\n1 - прямокутник;\n2 - трикутник;\n3 - коло.\nБудь ласка, зробіть свій вибір: ")   # Запитуємо у користувача, площу якої фігури він хоче розрахувати
    if choice == '1':               # Виклик функції для обчислення площі фігури, залежно від вибору користувача
        calc_rectangle_suare()
    elif choice == '2':
        calc_triangle_square()
    elif choice == '3':
        calc_circle_square()
    else:
        print('На жаль, поки обрати можна тільки із запропанованих варіантів. Спробуйте ще раз.')   # У разі, якщо користувач зробив "невірний" вибір
