import re

pattern = re.compile(r'^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[$#@])[A-Za-z\d$#@]{6,16}$')

print("""Програма перевірить введений пароль на відповідність мінімальним безпековим критеріям, а саме:
      - має містити хоча б одну малу літеру
      - має містити хоча б одну велику літеру
      - має містити хоча б одну цифру
      - має містити хоча б один символ із наступних: $#@
      """)
user_input = input("Введіть пароль для перевірки: ")
if bool(pattern.match(user_input)):
        print("Введений пароль відповідає мінімальним безпековим критеріям")
else:
        print("Введений пароль НЕ ВІДПОВІДАЄ мінімальним безпековим критеріям")

# tests = [
#          "$Ab1$",  #False - є хоча б один символ з кожної групи, але 5 символів
#          "$Ab1$2", #True - 6 символів і є хоча б один символ з кожної групи
#          "$ab1$2", #False - 6 символів, але немає великої літери
#          "$AG1$2", #False - 6 символів, немає малої літери
#          "#Abs@e", #False - 6 символів, немає цифри
#          "MAb1q2", #False - 6 символів, немає одного із символів $#@
#          "&Ab1e2", #False - 6 символів, немає одного із символів $#@ але є інший символ - & який не задовільняє умові
#          "a2r4@6K8#UA", #True - Валідне: 11 символів і є хоча б один символ з кожної групи
#          "a2r4@6K8#UAw9F$6", #True - Валідне: 16 символів і є хоча б один символ з кожної групи
#          "A2R4@6K8#UAW9F$6", #False - 6 символів, немає малої літери
#          "a2r4@6K8#UAw9F$17", #False - є хоча б один символ з кожної групи але 17 символів
#          ]
# for j in tests:
#     print(j, bool(pattern.match(j)))